#include <iostream>
using namespace std;

//数据类型的存在意义：为变量分配一个合适的内存空间（不同数据类型对应的内存空间大小不相同）
// 如：int a = 10; 为a申请一块int类型(4字节)的内存空间，存放数据10


// 整形：表示整数类型的数据（注意：byte(字节)=8bit）
// 
// short(短整型)，2字节，（取值范围-2^15 - 2^15-1）
// int(整形)，4字节，（取值范围-2^31 - 2^31-1）
// long(长整型)，Windows下为4字节，（取值范围-2^31 - 2^31-1）
// long  long(长长整形)，8字节，（取值范围-2^63 - 2^63-1）


//int main()
//{
//	short a = 10;
//	int b = 10;
//	long c = 10;
//	long long d = 10;
//	cout << "a.b.c.d分别为：" << a << "," << b << "," << c << "," << d << endl;
//
//	a = 32769;
//	cout << a << endl; // 输出-32767：若越界，截断后再转化
//
//	system("pause");
//	return 0;
//}