#include <iostream>
using namespace std;


// 实型：用来表示小数
// 1.单精度浮点型：float，4字节，精确到7位有效数字
// 2.双精度浮点型：double，8字节，精确到15位有效数字
// 【有效数字】：C++中浮点数的有效数字，包含[小数点前后]：3.14，是三位有效数字
//
// 科学计数法：如 314e-2，表示314*10^-2，即3.14


//int main()
//{
//	float f1 = 1.2345f;//【C++编译器中，小数如3.14默认为双精度，需要先转化为单精度再储存，多一个步骤；尽量直接用3.14f表示单精度】
//	double f2 = 1.2345678;
//	cout << "f1为：" << f1 << ",大小为：" << sizeof(f1) << endl;// f1为：1.2345,大小为：4
//	cout << "f2为：" << f2 << ",大小为：" << sizeof(f2) << endl;// f2为：1.23457,大小为：8【cout小数默认输出6位(这个位数包含小数前后)】
//
//
//	float f3 = 314e-2;// 科学计数法
//	cout << f3 << endl;//3.14
//
//	system("pause");
//	return 0;
//}

